Enterprise_Serivces/Cert/SilverGroup2/SecurityService/result1/Iteration1/t2_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <header>POST /SecurityService.svc HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: "http://www.gamestop.com/services/channel/security/contracts/2010/05/ISecurityService/ValidateDevice"
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: securityservicechannelqa1.testgs.pvt
Content-Length: 1268

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://www.gamestop.com/services/channel/security/contracts/2010/05/ISecurityService/ValidateDevice&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:29e2f131-acdd-49ce-8381-349cf5c030b1&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://securityservicechannelqa1.testgs.pvt/SecurityService.svc&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;ValidateDevice xmlns="http://www.gamestop.com/services/channel/security/contracts/2010/05"&gt;
      &lt;request&gt;
        &lt;MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05"&gt;test&lt;/MachineName&gt;
        &lt;AuthorizationToken xmlns="http://www.gamestop.com/services/channel/security/messages/2014/05"&gt;f2e633aa-cea9-4b65-9d4b-1cbb27ed5bcc&lt;/AuthorizationToken&gt;
        &lt;OpenIdClaimedIdentifier xmlns="http://www.gamestop.com/services/channel/security/messages/2014/05"&gt;/ID/091916134935357ujRr_2j00uyo7nAYb_52w&lt;/OpenIdClaimedIdentifier&gt;
      &lt;/request&gt;
    &lt;/ValidateDevice&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Content-Length: 583
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/8.5
Date: Tue, 14 Feb 2017 17:44:54 GMT

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;ValidateDeviceResponse xmlns="http://www.gamestop.com/services/channel/security/contracts/2010/05"&gt;
      &lt;ValidateDeviceResult xmlns:a="http://www.gamestop.com/services/channel/security/messages/2014/05" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;a:Status xmlns:b="http://www.gamestop.com/services/core/contracts/2010/05"&gt;
          &lt;b:StatusCode&gt;403.AuthenticationService.001&lt;/b:StatusCode&gt;
          &lt;b:StatusReason&gt;Unauthorized&lt;/b:StatusReason&gt;
        &lt;/a:Status&gt;
      &lt;/ValidateDeviceResult&gt;
    &lt;/ValidateDeviceResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </response>
  </http>
</report>